perf/results/20260906-final-nosample/public-read.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/public-read.js
        output: -

     scenarios: (100.00%) 3 scenarios, 350 max VUs, 1m30s max duration (incl. graceful stop):
              * detail: 50 looping VUs for 1m0s (exec: detail, gracefulStop: 30s)
              * list: 200 looping VUs for 1m0s (exec: browseList, gracefulStop: 30s)
              * search: 100 looping VUs for 1m0s (exec: search, gracefulStop: 30s)


running (0m00.8s), 350/350 VUs, 20 complete and 0 interrupted iterations
detail   [   1% ] 50 VUs   0m00.8s/1m0s
list     [   1% ] 200 VUs  0m00.8s/1m0s
search   [   1% ] 100 VUs  0m00.8s/1m0s

running (0m01.8s), 350/350 VUs, 84 complete and 0 interrupted iterations
detail   [   3% ] 50 VUs   0m01.8s/1m0s
list     [   3% ] 200 VUs  0m01.8s/1m0s
search   [   3% ] 100 VUs  0m01.8s/1m0s

running (0m02.8s), 350/350 VUs, 123 complete and 0 interrupted iterations
detail   [   5% ] 50 VUs   0m02.8s/1m0s
list     [   5% ] 200 VUs  0m02.8s/1m0s
search   [   5% ] 100 VUs  0m02.8s/1m0s

running (0m03.8s), 350/350 VUs, 164 complete and 0 interrupted iterations
detail   [   6% ] 50 VUs   0m03.8s/1m0s
list     [   6% ] 200 VUs  0m03.8s/1m0s
search   [   6% ] 100 VUs  0m03.8s/1m0s

running (0m04.7s), 350/350 VUs, 208 complete and 0 interrupted iterations
detail   [   8% ] 50 VUs   0m04.8s/1m0s
list     [   8% ] 200 VUs  0m04.8s/1m0s
search   [   8% ] 100 VUs  0m04.8s/1m0s

running (0m05.7s), 350/350 VUs, 247 complete and 0 interrupted iterations
detail   [  10% ] 50 VUs   0m05.8s/1m0s
list     [  10% ] 200 VUs  0m05.8s/1m0s
search   [  10% ] 100 VUs  0m05.8s/1m0s

running (0m06.7s), 350/350 VUs, 281 complete and 0 interrupted iterations
detail   [  11% ] 50 VUs   0m06.8s/1m0s
list     [  11% ] 200 VUs  0m06.8s/1m0s
search   [  11% ] 100 VUs  0m06.8s/1m0s

running (0m07.7s), 350/350 VUs, 307 complete and 0 interrupted iterations
detail   [  13% ] 50 VUs   0m07.8s/1m0s
list     [  13% ] 200 VUs  0m07.8s/1m0s
search   [  13% ] 100 VUs  0m07.8s/1m0s

running (0m08.7s), 350/350 VUs, 333 complete and 0 interrupted iterations
detail   [  15% ] 50 VUs   0m08.8s/1m0s
list     [  15% ] 200 VUs  0m08.8s/1m0s
search   [  15% ] 100 VUs  0m08.8s/1m0s

running (0m09.7s), 350/350 VUs, 381 complete and 0 interrupted iterations
detail   [  16% ] 50 VUs   0m09.8s/1m0s
list     [  16% ] 200 VUs  0m09.8s/1m0s
search   [  16% ] 100 VUs  0m09.8s/1m0s

running (0m10.7s), 350/350 VUs, 423 complete and 0 interrupted iterations
detail   [  18% ] 50 VUs   0m10.8s/1m0s
list     [  18% ] 200 VUs  0m10.8s/1m0s
search   [  18% ] 100 VUs  0m10.8s/1m0s

running (0m11.7s), 350/350 VUs, 469 complete and 0 interrupted iterations
detail   [  20% ] 50 VUs   0m11.8s/1m0s
list     [  20% ] 200 VUs  0m11.8s/1m0s
search   [  20% ] 100 VUs  0m11.8s/1m0s

running (0m12.7s), 350/350 VUs, 525 complete and 0 interrupted iterations
detail   [  21% ] 50 VUs   0m12.8s/1m0s
list     [  21% ] 200 VUs  0m12.8s/1m0s
search   [  21% ] 100 VUs  0m12.8s/1m0s

running (0m13.7s), 350/350 VUs, 593 complete and 0 interrupted iterations
detail   [  23% ] 50 VUs   0m13.8s/1m0s
list     [  23% ] 200 VUs  0m13.8s/1m0s
search   [  23% ] 100 VUs  0m13.8s/1m0s

running (0m14.7s), 350/350 VUs, 662 complete and 0 interrupted iterations
detail   [  25% ] 50 VUs   0m14.8s/1m0s
list     [  25% ] 200 VUs  0m14.8s/1m0s
search   [  25% ] 100 VUs  0m14.8s/1m0s

running (0m15.7s), 350/350 VUs, 708 complete and 0 interrupted iterations
detail   [  26% ] 50 VUs   0m15.8s/1m0s
list     [  26% ] 200 VUs  0m15.8s/1m0s
search   [  26% ] 100 VUs  0m15.8s/1m0s

running (0m16.7s), 350/350 VUs, 771 complete and 0 interrupted iterations
detail   [  28% ] 50 VUs   0m16.8s/1m0s
list     [  28% ] 200 VUs  0m16.8s/1m0s
search   [  28% ] 100 VUs  0m16.8s/1m0s

running (0m17.7s), 350/350 VUs, 840 complete and 0 interrupted iterations
detail   [  30% ] 50 VUs   0m17.8s/1m0s
list     [  30% ] 200 VUs  0m17.8s/1m0s
search   [  30% ] 100 VUs  0m17.8s/1m0s

running (0m18.7s), 350/350 VUs, 918 complete and 0 interrupted iterations
detail   [  31% ] 50 VUs   0m18.8s/1m0s
list     [  31% ] 200 VUs  0m18.8s/1m0s
search   [  31% ] 100 VUs  0m18.8s/1m0s

running (0m19.7s), 350/350 VUs, 999 complete and 0 interrupted iterations
detail   [  33% ] 50 VUs   0m19.8s/1m0s
list     [  33% ] 200 VUs  0m19.8s/1m0s
search   [  33% ] 100 VUs  0m19.8s/1m0s

running (0m20.7s), 350/350 VUs, 1094 complete and 0 interrupted iterations
detail   [  35% ] 50 VUs   0m20.8s/1m0s
list     [  35% ] 200 VUs  0m20.8s/1m0s
search   [  35% ] 100 VUs  0m20.8s/1m0s

running (0m21.7s), 350/350 VUs, 1191 complete and 0 interrupted iterations
detail   [  36% ] 50 VUs   0m21.8s/1m0s
list     [  36% ] 200 VUs  0m21.8s/1m0s
search   [  36% ] 100 VUs  0m21.8s/1m0s

running (0m22.7s), 350/350 VUs, 1277 complete and 0 interrupted iterations
detail   [  38% ] 50 VUs   0m22.8s/1m0s
list     [  38% ] 200 VUs  0m22.8s/1m0s
search   [  38% ] 100 VUs  0m22.8s/1m0s

running (0m23.7s), 350/350 VUs, 1332 complete and 0 interrupted iterations
detail   [  40% ] 50 VUs   0m23.8s/1m0s
list     [  40% ] 200 VUs  0m23.8s/1m0s
search   [  40% ] 100 VUs  0m23.8s/1m0s

running (0m24.7s), 350/350 VUs, 1403 complete and 0 interrupted iterations
detail   [  41% ] 50 VUs   0m24.8s/1m0s
list     [  41% ] 200 VUs  0m24.8s/1m0s
search   [  41% ] 100 VUs  0m24.8s/1m0s

running (0m25.7s), 350/350 VUs, 1511 complete and 0 interrupted iterations
detail   [  43% ] 50 VUs   0m25.8s/1m0s
list     [  43% ] 200 VUs  0m25.8s/1m0s
search   [  43% ] 100 VUs  0m25.8s/1m0s

running (0m26.7s), 350/350 VUs, 1645 complete and 0 interrupted iterations
detail   [  45% ] 50 VUs   0m26.8s/1m0s
list     [  45% ] 200 VUs  0m26.8s/1m0s
search   [  45% ] 100 VUs  0m26.8s/1m0s

running (0m27.7s), 350/350 VUs, 1784 complete and 0 interrupted iterations
detail   [  46% ] 50 VUs   0m27.8s/1m0s
list     [  46% ] 200 VUs  0m27.8s/1m0s
search   [  46% ] 100 VUs  0m27.8s/1m0s

running (0m28.7s), 350/350 VUs, 1908 complete and 0 interrupted iterations
detail   [  48% ] 50 VUs   0m28.8s/1m0s
list     [  48% ] 200 VUs  0m28.8s/1m0s
search   [  48% ] 100 VUs  0m28.8s/1m0s

running (0m29.7s), 350/350 VUs, 2039 complete and 0 interrupted iterations
detail   [  50% ] 50 VUs   0m29.8s/1m0s
list     [  50% ] 200 VUs  0m29.8s/1m0s
search   [  50% ] 100 VUs  0m29.8s/1m0s

running (0m30.7s), 350/350 VUs, 2132 complete and 0 interrupted iterations
detail   [  51% ] 50 VUs   0m30.8s/1m0s
list     [  51% ] 200 VUs  0m30.8s/1m0s
search   [  51% ] 100 VUs  0m30.8s/1m0s

running (0m31.7s), 350/350 VUs, 2201 complete and 0 interrupted iterations
detail   [  53% ] 50 VUs   0m31.8s/1m0s
list     [  53% ] 200 VUs  0m31.8s/1m0s
search   [  53% ] 100 VUs  0m31.8s/1m0s

running (0m32.7s), 350/350 VUs, 2264 complete and 0 interrupted iterations
detail   [  55% ] 50 VUs   0m32.8s/1m0s
list     [  55% ] 200 VUs  0m32.8s/1m0s
search   [  55% ] 100 VUs  0m32.8s/1m0s

running (0m33.7s), 350/350 VUs, 2317 complete and 0 interrupted iterations
detail   [  56% ] 50 VUs   0m33.8s/1m0s
list     [  56% ] 200 VUs  0m33.8s/1m0s
search   [  56% ] 100 VUs  0m33.8s/1m0s

running (0m34.8s), 350/350 VUs, 2371 complete and 0 interrupted iterations
detail   [  58% ] 50 VUs   0m34.8s/1m0s
list     [  58% ] 200 VUs  0m34.8s/1m0s
search   [  58% ] 100 VUs  0m34.8s/1m0s

running (0m35.8s), 350/350 VUs, 2462 complete and 0 interrupted iterations
detail   [  60% ] 50 VUs   0m35.8s/1m0s
list     [  60% ] 200 VUs  0m35.8s/1m0s
search   [  60% ] 100 VUs  0m35.8s/1m0s

running (0m36.8s), 350/350 VUs, 2561 complete and 0 interrupted iterations
detail   [  61% ] 50 VUs   0m36.8s/1m0s
list     [  61% ] 200 VUs  0m36.8s/1m0s
search   [  61% ] 100 VUs  0m36.8s/1m0s

running (0m37.8s), 350/350 VUs, 2647 complete and 0 interrupted iterations
detail   [  63% ] 50 VUs   0m37.8s/1m0s
list     [  63% ] 200 VUs  0m37.8s/1m0s
search   [  63% ] 100 VUs  0m37.8s/1m0s

running (0m38.8s), 350/350 VUs, 2800 complete and 0 interrupted iterations
detail   [  65% ] 50 VUs   0m38.8s/1m0s
list     [  65% ] 200 VUs  0m38.8s/1m0s
search   [  65% ] 100 VUs  0m38.8s/1m0s

running (0m39.8s), 350/350 VUs, 2925 complete and 0 interrupted iterations
detail   [  66% ] 50 VUs   0m39.9s/1m0s
list     [  66% ] 200 VUs  0m39.9s/1m0s
search   [  66% ] 100 VUs  0m39.9s/1m0s

running (0m40.8s), 350/350 VUs, 2986 complete and 0 interrupted iterations
detail   [  68% ] 50 VUs   0m40.8s/1m0s
list     [  68% ] 200 VUs  0m40.8s/1m0s
search   [  68% ] 100 VUs  0m40.8s/1m0s

running (0m41.8s), 350/350 VUs, 3048 complete and 0 interrupted iterations
detail   [  70% ] 50 VUs   0m41.8s/1m0s
list     [  70% ] 200 VUs  0m41.8s/1m0s
search   [  70% ] 100 VUs  0m41.8s/1m0s

running (0m42.8s), 350/350 VUs, 3124 complete and 0 interrupted iterations
detail   [  71% ] 50 VUs   0m42.8s/1m0s
list     [  71% ] 200 VUs  0m42.8s/1m0s
search   [  71% ] 100 VUs  0m42.8s/1m0s

running (0m43.8s), 350/350 VUs, 3179 complete and 0 interrupted iterations
detail   [  73% ] 50 VUs   0m43.8s/1m0s
list     [  73% ] 200 VUs  0m43.8s/1m0s
search   [  73% ] 100 VUs  0m43.8s/1m0s

running (0m44.8s), 350/350 VUs, 3261 complete and 0 interrupted iterations
detail   [  75% ] 50 VUs   0m44.8s/1m0s
list     [  75% ] 200 VUs  0m44.8s/1m0s
search   [  75% ] 100 VUs  0m44.8s/1m0s

running (0m45.8s), 350/350 VUs, 3330 complete and 0 interrupted iterations
detail   [  76% ] 50 VUs   0m45.8s/1m0s
list     [  76% ] 200 VUs  0m45.8s/1m0s
search   [  76% ] 100 VUs  0m45.8s/1m0s

running (0m46.8s), 350/350 VUs, 3397 complete and 0 interrupted iterations
detail   [  78% ] 50 VUs   0m46.8s/1m0s
list     [  78% ] 200 VUs  0m46.8s/1m0s
search   [  78% ] 100 VUs  0m46.8s/1m0s

running (0m47.8s), 350/350 VUs, 3464 complete and 0 interrupted iterations
detail   [  80% ] 50 VUs   0m47.8s/1m0s
list     [  80% ] 200 VUs  0m47.8s/1m0s
search   [  80% ] 100 VUs  0m47.8s/1m0s

running (0m48.8s), 350/350 VUs, 3525 complete and 0 interrupted iterations
detail   [  81% ] 50 VUs   0m48.8s/1m0s
list     [  81% ] 200 VUs  0m48.8s/1m0s
search   [  81% ] 100 VUs  0m48.8s/1m0s

running (0m49.8s), 350/350 VUs, 3613 complete and 0 interrupted iterations
detail   [  83% ] 50 VUs   0m49.8s/1m0s
list     [  83% ] 200 VUs  0m49.8s/1m0s
search   [  83% ] 100 VUs  0m49.8s/1m0s

running (0m50.8s), 350/350 VUs, 3737 complete and 0 interrupted iterations
detail   [  85% ] 50 VUs   0m50.8s/1m0s
list     [  85% ] 200 VUs  0m50.8s/1m0s
search   [  85% ] 100 VUs  0m50.8s/1m0s

running (0m51.8s), 350/350 VUs, 3902 complete and 0 interrupted iterations
detail   [  86% ] 50 VUs   0m51.8s/1m0s
list     [  86% ] 200 VUs  0m51.8s/1m0s
search   [  86% ] 100 VUs  0m51.8s/1m0s

running (0m52.8s), 350/350 VUs, 4057 complete and 0 interrupted iterations
detail   [  88% ] 50 VUs   0m52.8s/1m0s
list     [  88% ] 200 VUs  0m52.8s/1m0s
search   [  88% ] 100 VUs  0m52.8s/1m0s

running (0m53.8s), 350/350 VUs, 4197 complete and 0 interrupted iterations
detail   [  90% ] 50 VUs   0m53.8s/1m0s
list     [  90% ] 200 VUs  0m53.8s/1m0s
search   [  90% ] 100 VUs  0m53.8s/1m0s

running (0m54.8s), 350/350 VUs, 4356 complete and 0 interrupted iterations
detail   [  91% ] 50 VUs   0m54.8s/1m0s
list     [  91% ] 200 VUs  0m54.8s/1m0s
search   [  91% ] 100 VUs  0m54.8s/1m0s

running (0m55.8s), 350/350 VUs, 4472 complete and 0 interrupted iterations
detail   [  93% ] 50 VUs   0m55.8s/1m0s
list     [  93% ] 200 VUs  0m55.8s/1m0s
search   [  93% ] 100 VUs  0m55.8s/1m0s

running (0m56.8s), 350/350 VUs, 4534 complete and 0 interrupted iterations
detail   [  95% ] 50 VUs   0m56.8s/1m0s
list     [  95% ] 200 VUs  0m56.8s/1m0s
search   [  95% ] 100 VUs  0m56.8s/1m0s

running (0m57.8s), 350/350 VUs, 4585 complete and 0 interrupted iterations
detail   [  96% ] 50 VUs   0m57.8s/1m0s
list     [  96% ] 200 VUs  0m57.8s/1m0s
search   [  96% ] 100 VUs  0m57.8s/1m0s

running (0m58.8s), 350/350 VUs, 4631 complete and 0 interrupted iterations
detail   [  98% ] 50 VUs   0m58.8s/1m0s
list     [  98% ] 200 VUs  0m58.8s/1m0s
search   [  98% ] 100 VUs  0m58.8s/1m0s

running (0m59.8s), 350/350 VUs, 4691 complete and 0 interrupted iterations
detail   [ 100% ] 50 VUs   0m59.8s/1m0s
list     [ 100% ] 200 VUs  0m59.8s/1m0s
search   [ 100% ] 100 VUs  0m59.8s/1m0s

running (1m00.8s), 288/350 VUs, 4767 complete and 0 interrupted iterations
detail ↓ [ 100% ] 50 VUs   1m0s
list   ↓ [ 100% ] 200 VUs  1m0s
search ↓ [ 100% ] 100 VUs  1m0s

running (1m01.8s), 166/350 VUs, 4889 complete and 0 interrupted iterations
detail ↓ [ 100% ] 50 VUs   1m0s
list   ↓ [ 100% ] 200 VUs  1m0s
search ↓ [ 100% ] 100 VUs  1m0s

running (1m02.8s), 059/350 VUs, 4996 complete and 0 interrupted iterations
detail ↓ [ 100% ] 50 VUs   1m0s
list   ↓ [ 100% ] 200 VUs  1m0s
search ↓ [ 100% ] 100 VUs  1m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    t_detail
    ✗ 'p(95)<500' p(95)=9.1s

    t_list
    ✗ 'p(95)<500' p(95)=8.76s

    t_search
    ✗ 'p(95)<500' p(95)=8.92s


  █ TOTAL RESULTS 

    checks_total.......: 5055    79.61334/s
    checks_succeeded...: 100.00% 5055 out of 5055
    checks_failed......: 0.00%   0 out of 5055

    ✓ search 200
    ✓ list 200
    ✓ detail 200

    CUSTOM
    t_detail.......................: avg=4.23s min=792.07ms med=3.91s p(50)=3.91s p(95)=9.1s  p(99)=11.66s max=12.74s
    t_list.........................: avg=4.26s min=389.84ms med=3.89s p(50)=3.89s p(95)=8.76s p(99)=12.01s max=18.72s
    t_search.......................: avg=4.29s min=245.05ms med=3.95s p(50)=3.95s p(95)=8.92s p(99)=11.58s max=14.56s

    HTTP
    http_req_duration..............: avg=4.26s min=245.05ms med=3.92s p(50)=3.92s p(95)=8.82s p(99)=11.81s max=18.72s
      { expected_response:true }...: avg=4.26s min=245.05ms med=3.92s p(50)=3.92s p(95)=8.82s p(99)=11.81s max=18.72s
    http_req_failed................: 0.00%  0 out of 5055
    http_reqs......................: 5055   79.61334/s

    EXECUTION
    iteration_duration.............: avg=4.27s min=312.64ms med=3.93s p(50)=3.93s p(95)=8.93s p(99)=11.91s max=18.98s
    iterations.....................: 5055   79.61334/s
    vus............................: 59     min=59        max=350
    vus_max........................: 350    min=350       max=350

    NETWORK
    data_received..................: 62 MB  974 kB/s
    data_sent......................: 528 kB 8.3 kB/s



running (1m03.5s), 000/350 VUs, 5055 complete and 0 interrupted iterations
detail ✓ [ 100% ] 50 VUs   1m0s
list   ✓ [ 100% ] 200 VUs  1m0s
search ✓ [ 100% ] 100 VUs  1m0s
time="2026-09-06T09:35:04Z" level=error msg="thresholds on metrics 't_detail, t_list, t_search' have been crossed"